{
  "namespace": "hologram.view.docs",
  "parent": "hologram.view",
  "conformance": true,
  "version": "1.0.0",
  "description": "Documentation for view conformance",
  "docs": {
    "version": "1.0.0",
    "description": "Comprehensive documentation for the view conformance system",
    "sections": [
      {
        "title": "Overview",
        "content": "The hologram.view component defines how Hologram components are visually presented across different contexts and platforms. It provides a comprehensive system for declaring rendering templates, content sections, and interaction patterns."
      },
      {
        "title": "Template System",
        "content": "Templates define the overall layout pattern and style for rendering a component. Options include component-detail for focused views, component-grid for collections, documentation for narrative content, dashboard for metrics, and custom for specialized layouts."
      },
      {
        "title": "Sections",
        "content": "Sections are the building blocks of a view, defining what content to display and how. Each section pulls data from component specs or conformance files, transforms it for display (raw, markdown, json, diagram, graph, table), and can be conditionally shown or hidden."
      },
      {
        "title": "Rendering Modes",
        "content": "Views support multiple rendering contexts: web (static HTML or framework-based), terminal (ANSI or plain text), API (JSON/XML/YAML responses), and print (PDF/HTML output). Each mode can have its own configuration and features."
      },
      {
        "title": "Inheritance",
        "content": "Views support inheritance through the 'extends' field, allowing specialized components to build on base view definitions while customizing specific aspects. This enables consistent presentation across component families."
      },
      {
        "title": "Accessibility",
        "content": "Views must include accessibility features like ARIA labels, keyboard navigation support, screen reader optimization, and optional high contrast modes to ensure components are usable by all users."
      },
      {
        "title": "Navigation",
        "content": "Views can define navigation features including breadcrumbs, sibling/child component links, and search capabilities with configurable fields for indexing."
      },
      {
        "title": "Interactions",
        "content": "User interactions can be defined through actions (copy, download, share, edit, validate) and event handlers for dynamic behavior in interactive contexts."
      }
    ]
  }
}